ПД_sev/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <basedOn>Catalog.Проекты</basedOn>
  <addressing>InformationRegister.РегистрАдресации</addressing>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

ПД_sev/src/Tasks/ЗадачиПользователя/ObjectModule.bsl
Перем ПользовательВыполнятель Экспорт;  

Процедура ПередИнтерактивнымВыполнением(Отказ)
	// Вставить содержимое обработчика.
	//Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//
	//Если НЕ Куратор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
	//	И Куратор.ТелеграмИД > 0 Тогда
	//	ТекстСообщения = "Пользователь <strong>" + Пользователь + "</strong> выполнил задачу" + Символы.ПС + Наименование + Символы.ПС + "<strong>С комментарием</strong> " + Символы.ПС + Комментарий;
	//	ИнтеграцияСTelegramСервер.СообщениеПользователю(Новый Структура("id", Куратор.ТелеграмИД), ТекстСообщения,,, "HTML");
	//КонецЕсли;	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	Если НЕ Куратор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка")
		И Куратор.ТелеграмИД > 0 Тогда
		ТекстСообщения = "Пользователь <strong>" + ПользовательВыполнятель + "</strong> выполнил задачу" + Символы.ПС + Наименование + Символы.ПС + "<strong>С комментарием</strong> " + Символы.ПС + Комментарий;
		ИнтеграцияСTelegramСервер.СообщениеПользователю(Новый Структура("id", Куратор.ТелеграмИД), ТекстСообщения,,, "HTML");
	КонецЕсли;
	Если Не ПользовательВыполнятель = Исполнитель 
		И Исполнитель.ТелеграмИД > 0 Тогда
		ТекстСообщения = "Пользователь <strong>" + ПользовательВыполнятель + "</strong> выполнил задачу" + Символы.ПС + Наименование + Символы.ПС + "<strong>С комментарием</strong> " + Символы.ПС + Комментарий;
		ИнтеграцияСTelegramСервер.СообщениеПользователю(Новый Структура("id", Исполнитель.ТелеграмИД), ТекстСообщения,,, "HTML");		
	КонецЕсли;
КонецПроцедуры


ПользовательВыполнятель = ПараметрыСеанса.ТекущийПользователь;
